{
    "meta": {
        "title": "Portafolio José Enrique - Desarrollador Front End",
        "description": "Portafolio de un desarrollador Front End con experiencia en Angular, React, Node.js. y más.",
        "keywords": "portafolio, desarrollador, front end, angular, react, node.js"
    },
    "header": {
        "choose_languaje": "Elegir idioma",
        "lang_options": {
            "spanish": "Español",
            "english": "Ingles"
        }
    },
    "about": {
        "welcome_msg": "Saludos! Soy",
        "position": "Desarrollador Front End",
        "experience": "Años de experiencia",
        "description": "Desarrollador web y móvil con experiencia en la creación de aplicaciones utilizando tecnologías como Angular, React, Node.js y mas. Busco constantemente mejorar mis habilidades aprendiendo nuevas tecnologías y herramientas."
    },
    "skills": {
        "title": "Habilidades"
    },
    "projects": {
        "title": "Proyectos",
        "description": "A continuación se presentan algunos de los proyectos en los que he trabajado. Debido a acuerdos de confidencialidad, no puedo compartir todos los detalles de cada proyecto, como repositorios o enlaces al sitio web en producción, pero he incluido una breve descripción de lo realizado y las tecnologías utilizadas.",
        "list":[
            {
                "title": "Mi Gestion Sukarne",
                "description": "Herramienta de la plataforma interna principal para gestionar reconocimientos, oportunidades de mejora del personal y control de accesos.",
                "tasks": [
                    "Acceso basado en roles",
                    "Módulo para asignación, visualización y seguimiento de reconocimientos y oportunidades de mejora",
                    "Generación de reportes con base en diferentes filtros segun el rol de usuario"
                ]
            },
            {
                "title": "Visibility ",
                "description": "Aplicación web para visualización de datos corporativos, con dashboards y control de accesos.",
                "tasks": [
                    "Acceso basado en roles y codigos de seguridad",
                    "Visualizacion de datos aplicación de filtros y generación de reportes segun el rol de usuario",
                    "Generacion y descarga de reportes segun el rol de usuario",
                    "Módulo para la gestión de usuarios"
                ]
            },
            {
                "title": "Hyundai Loyalty App",
                "description": "Aplicación móvil para clientes de Hyundai, enfocada en fidelización mediante seguimiento de servicios, promociones personalizadas y geolocalización de distribuidores.",
                "tasks": [
                    "Registro y autenticación de usuarios.",
                    "Visualización de datos de vehículos, historial de servicios y promociones vigentes",
                    "Mapa interactivo con distribuidores cercanos y detalles de contacto."
                ]
            },
            {
                "title": "Portal de promociones",
                "description": "Aplicacion web para administrar promociones de Palacio de Hierro, desde creación hasta monitoreo y control de accesos.",
                "tasks": [
                    "Acceso basado en roles",
                    "Carga de layouts para generación automatizada de promociones",
                    "Dashboard de datos segun el rol de usuario",
                    "Módulo para la gestión de usuarios"
                ]
            },
            {
                "title": "Soluciones de empaque MyM",
                "description": "Aplicacion web para la gestion de pedidos por parte de los clientes de Soluciones de Empaque MyM",
                "tasks": [
                    "Acceso a usuarios",
                    "Carrito de compras con creación y edición de pedidos",
                    "Historial de pedidos con seguimiento de estados",
                    "Solicitudes de cotización",
                    "Módulo para la gestión de direcciones de envio"
                ]
            },
            {
                "title": "Mapas App",
                "description": "Aplicación web del curso Angular 2025, donde se visualizan mapas con diferentes opciones usando MapLibre.",
                "tasks": [
                    "Mapa en pantalla completa",
                    "Añadir, quitar y mover hacia marcadores",
                    "Listado de objetos con marcadores y visualización de ubicación en minimapa",
                    "Listado de escuelas de Hidalgo en un accordion con filtro por nombre"
                ]
            }
        ]
    },
    "experience": {
        "title": "Experiencia",
        "list": [
            {
                "title": "Desarrollador Full Stack",
                "employer": "Dostics",
                "date": "Febrero 2022 - Febrero 2023",
                "description": "Desarrollo de aplicaciones web utilizando React y Redux."
            },
            {
                "title": "Desarrollador Frontend",
                "employer": "Casa Mecate",
                "date": "Febrero 2024 - Febrero 2025",
                "description": "Desarrollo de aplicaciones web utilizando React y Redux."
            }
        ]
    },
    "contact": {
        "title": "Contacto",
        "description": "Si deseas ponerte en contacto conmigo, puedes hacerlo a través de los siguientes medios:"
    },
    "options": {
        "show_details": "Mostrar detalles",
        "site": "Visitar sitio",
        "download_cv": "Descargar CV"
    }
}
